# 데이터 프레임 합치기
- 서울시 초등학교
- 서울시 중학교
- 서울시 고등학교
- 서울시 대학교
- 서울시 백화점
- 서울시 맥도날드
- 서울시 스타벅스
- 서울시 역

In [1]:
ele_df = pd.read_csv("ele_geo.csv")

In [2]:
mid_df = pd.read_csv("mid_geo.csv")

In [3]:
high_df = pd.read_csv("high_geo.csv")

In [4]:
uni_df = pd.read_csv("uni_geo.csv")

In [6]:
mall_df = pd.read_csv("geo_mall.csv")

In [7]:
mc_df = pd.read_csv("mc_geo.csv")

In [8]:
star_df = pd.read_csv("starbucks_data.csv")

In [9]:
station_df = pd.read_csv("station_geo.csv")

In [11]:
ele_df["label"] = "초등학교"
ele_df.head()

       name        lat         lng label
0  서울안산초등학교  37.579016  126.951524  초등학교
1  서울역촌초등학교  37.601738  126.914406  초등학교
2  서울연가초등학교  37.580202  126.918076  초등학교
3  서울연광초등학교  37.623826  126.924066  초등학교
4  서울연신초등학교  37.626261  126.928274  초등학교

In [12]:
mid_df["label"] = "중학교"
mid_df.head()

     name        lat         lng label
0   양화중학교  37.519773  126.896054   중학교
1  여의도중학교  37.523948  126.935715   중학교
2   영남중학교  37.497624  126.895893   중학교
3   영림중학교  37.497554  126.890374   중학교
4   영서중학교  37.488968  126.894220   중학교

In [13]:
high_df["label"] = "고등학교"
high_df.head()

              name        lat         lng label
0           국악고등학교  37.475978  127.051613  고등학교
1  서울대학교사범대학부설고등학교  37.592727  127.037852  고등학교
2         전통예술고등학교  37.446354  126.906424  고등학교
3           가락고등학교  37.501192  127.116591  고등학교
4          가재울고등학교  37.574226  126.909565  고등학교

In [14]:
uni_df["label"] = "대학교"
uni_df.head()

      name        lat         lng label
0  서울시립대학교  37.583866  127.058777   대학교
1  서울여자대학교  37.628113  127.090457   대학교
2   성공회대학교  37.487233  126.825320   대학교
3   성균관대학교  37.588227  126.993606   대학교
4  성신여자대학교  37.591505  127.020326   대학교

In [15]:
mall_df["label"] = "몰"
mall_df.head()

           name        lat         lng label
0     신세계백화점 본점  37.560918  126.981133     몰
1    신세계백화점 강남점  37.504130  127.003069     몰
2   신세계백화점 영등포점  37.517626  126.905250     몰
3  현대백화점 디큐브시티점  37.508432  126.888733     몰
4   현대백화점 무역센터점  37.508543  127.059769     몰

In [16]:
mc_df["label"] = "맥도날드"
mc_df.head()

        name        lat         lng label
0      가락DT점  37.494854  127.130785  맥도날드
1     가산디지털점  37.481377  126.883705  맥도날드
2  가산비지니스센터점  37.480127  126.881037  맥도날드
3      강남2호점  37.498655  127.028744  맥도날드
4      강남구청점  37.516236  127.041313  맥도날드

In [18]:
star_df["label"] = "스타벅스"
star_df.head()

       name        lat        long label
0    논현역사거리  37.510178  127.022223  스타벅스
1  삼성역섬유센터R  37.507750  127.060651  스타벅스
2      압구정R  37.527367  127.033061  스타벅스
3      수서역R  37.488008  127.102650  스타벅스
4   양재강남빌딩R  37.485192  127.036685  스타벅스

In [36]:
star_df.columns = ["name", "lat", "lng", "label"]

In [22]:
station_df["label"] = "역"
station_df.head()

      name        lat         lng label
0  419민주묘지  37.650306  127.013289     역
1     가락시장  37.492522  127.118234     역
2  가산디지털단지  37.481072  126.882343     역
3       가양  37.561391  126.854456     역
4      가오리  37.641422  127.016766     역

In [40]:
geo_df = pd.concat([ele_df, mid_df, high_df, uni_df, mall_df, mc_df, star_df, station_df], ignore_index=True)

In [41]:
geo_df.to_csv("geo_df.csv", index=False)